Revit 2027 API
FamilyInstanceCreationData(Face, XYZ, XYZ, FamilySymbol) Constructor
Initializes a new instance of the FamilyInstanceCreationData class
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyInstanceCreationData(
	Face face,
	XYZ location,
	XYZ referenceDirection,
	FamilySymbol symbol
)
Public Sub New (
	face As Face,
	location As XYZ,
	referenceDirection As XYZ,
	symbol As FamilySymbol
)
public:
FamilyInstanceCreationData(
	Face^ face,
	XYZ^ location,
	XYZ^ referenceDirection,
	FamilySymbol^ symbol
)
new :
        face : Face *
        location : XYZ *
        referenceDirection : XYZ *
        symbol : FamilySymbol -> FamilyInstanceCreationData
Parameters
face Face
A face of a geometry object.
location XYZ
Point on the face where the instance is to be placed.
referenceDirection XYZ
A vector that defines the direction of the family instance.
symbol FamilySymbol
A FamilySymbol object that represents the type of the instance that is to be inserted.
See Also
Reference
FamilyInstanceCreationData Class
FamilyInstanceCreationData Overload
Autodesk.Revit.Creation Namespace